
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СравнениеЗначений = Новый СравнениеЗначений;
	
	Товары.Сортировать("Номенклатура", СравнениеЗначений);
		
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ТестовыйРНОбороты 
	Движения.ТестовыйРНОбороты.Записывать = Истина;
	Движение = Движения.ТестовыйРНОбороты.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Номенклатура = Номенклатура;
	Движение.СуммаОперации = СуммаОперации;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Отказ = Ложь;
	
	НаборЗаписей = РегистрыНакопления.ТестовыйРНОбороты.СоздатьНаборЗаписей();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТестовыйРНОборотыОбороты.Организация КАК Организация,
		|	ТестовыйРНОборотыОбороты.Номенклатура КАК Номенклатура,
		|	ТестовыйРНОборотыОбороты.СуммаОперацииОборот КАК СуммаОперацииОборот
		|ИЗ
		|	РегистрНакопления.ТестовыйРНОбороты.Обороты КАК ТестовыйРНОборотыОбороты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	
	
КонецПроцедуры


