
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ХранилищеНастроек.Получить();
	
	тр = Новый Структура("Организация", "ГАЛС");
	тр["Организация"] = 1; 
	
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыОбъектовСрезПоследних.Объект.Код КАК Объект,
		|	СтатусыОбъектовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыОбъектов.СрезПоследних(&Период, Объект = &Объект) КАК СтатусыОбъектовСрезПоследних
		|ГДЕ
		|	СтатусыОбъектовСрезПоследних.Статус = &СтатусДействующий";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("СтатусДействующий", "Действущий");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

// Выбранное значение - Массив из СправочникСсылка.Номенклатура
// У Номенклатуры есть реквизит Вид - Строка, принимает значения "Услуга", "Товар"

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для каждого Товар Из ВыбранноеЗначение Цикл	
		Если ПолучитьВидНоменклатуры(Товар) = "Услуга" Тогда		
			Продолжить;	
		КонецЕсли;
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Товар = Товар;
		НоваяСтрока.Стоимость = ПолучитьСтоимостьТовараИзНакладной(Товар);
		НоваяСтрока.Количество = 1;
	КонецЦикла;
	
	Сообщить("Подбор товара завершен");

КонецПроцедуры

&НаСервере
Функция ПолучитьВидНоменклатуры(Номенклатура)
	Возврат Номенклатура.Вид;
КонецФункции // ()

// РС СтоимостьТоваров - независимый, непериодический
// Измерения:
//		- Товар - СправочникСсылка.Номенклатура
//		- ДокументПоступления - ДокументСсылка
// Ресурсы:
//		- Стоимость - число
&НаСервере
Функция ПолучитьСтоимостьТовараИзНакладной(Номенклатура)
	
	Набор = РегистрыСведений.СтоимостьТоваров.СоздатьНаборЗаписей();
	Набор.Отбор.Товар.Установить(Номенклатура);
	Набор.Прочитать();
	
	Возврат Набор[0].Стоимость; 
	
КонецФункции // ()




&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Отказ = Истина;
		Сообщить("Ответственный не заполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтветственного(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Сообщить("Ответственный уже заполнен");
		Возврат;
	КонецЕсли;

	Объект.Ответственный = "Гендрик";
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПоСкладу(Команда)
		
КонецПроцедуры




